[
  {
    "url": "https://www.it-daily.net/en/shortnews-en/bitcoin-extends-weekend-gains",
    "headline": "Bitcoin extends weekend gains",
    "text": "Bitcoin is approaching its record high from mid-July with strong gains. The price of Bitcoin rose to 122,300 dollars (104,820 euros) in early trading on the Bitstamp trading.\n\nThe price of the oldest and best-known digital currency recently fell slightly, but at around 122,220 dollars it was still approximately 5,000 dollars higher than at the end of last week.\n\nBitcoin had already risen in price by around 3,000 dollars over the weekend. According to Rachael Lucas, crypto analyst at BTC Markets, the increase is due to a high level of interest from institutional investors.\n\nThe rise of Bitcoin is being supported by steady purchases by corporations to manage corporate finance, inflows into exchange-traded funds (ETFs) and a change in sentiment following new US tariffs on imported gold bullion, Lucas told Bloomberg news agency. “With gold supply shortages and political risks, Bitcoin is gaining traction with investors as a borderless, duty-free store of value.”\n\nAfter reaching a record high of 123,236 dollars in mid-July on the Bitstamp trading platform, Bitcoin plummeted to around 112,000 dollars at the beginning of August before recovering again.\n\ndpa"
  },
  {
    "url": "https://www.it-daily.net/en/shortnews-en/openai-gpt-4o-returns-after-shaky-gpt-5-start",
    "headline": "OpenAI: GPT-4o returns after bumpy GPT-5 start",
    "text": "After just one day, OpenAI is bringing its popular predecessor GPT-4o back to ChatGPT. Users criticize GPT-5 as soulless and impersonal.\n\nOpenAI CEO Sam Altman has responded to the massive criticism of the GPT-5 rollout and announced that Plus users will once again be able to choose between the models. Just one day after replacing GPT-4o with GPT-5, the company is backtracking and making the popular predecessor model available again.\n\nUsers miss the “personality” of GPT-4o\n\n“We will let Plus users choose to continue to use 4o,” Altman wrote on X (formerly Twitter). “We will watch usage as we think about how long to offer legacy models for.” The decision follows a wave of criticism from ChatGPT users who complained about the loss of their familiar AI assistant. The dissatisfaction became clear in online forums and social media, where numerous users wished for the old assistant back. The quality of the answers was also criticized.\n\nModel selection disappeared with GPT-5\n\nWith the introduction of GPT-5, OpenAI had removed the model selection from ChatGPT. The drop-down menu previously allowed users to switch between different model variants – from GPT-4o for complex tasks to more efficient versions such as o4 mini for simpler work. This flexibility was initially lost with the GPT-5 update.\n\nOpenAI had advertised GPT-5 as a significant advance in writing and programming capabilities. ChatGPT fans waited months for the release of the new flagship model. But shortly after the launch, many users wanted to return to their familiar assistant.\n\n“Chart Crime”: Embarrassing mistake during the presentation\n\nAn additional embarrassment was caused by a serious display error in the live presentation of GPT-5. One chart showed lower benchmark values with disproportionately high bars – a classic case of misleading data visualization that quickly went viral on social media as “chart crime”.\n\nAltman later described the incident on X as a “mega chart blunder”. In the published blog version, the charts were displayed correctly, but the damage had already been done.\n\nOpenAI promises improvements\n\nIn view of the criticism, Altman promised to make corrections to the points criticized. “We will continue to work on stabilizing things and listen to the feedback,” he promised."
  },
  {
    "url": "https://www.wired.com/story/black-market-for-fraudulent-science-growing-faster-than-legitimate-research/",
    "headline": "The Black Market for Fake Science Is Growing Faster Than Legitimate Research, Study Warns",
    "text": "A new study by researchers at Northwestern University has set off alarm bells about the future of academic research, warning that the publication of fraudulent science is growing at a faster rate than that of legitimate research.\n\nOver the last four centuries, an implicit contract has been established between scientists and states: in exchange for producing knowledge useful for economic and social development, governments and other benefactors offer researchers stable careers, good salaries, and public recognition. This model, similar to that of a commercial enterprise, has proven to be efficient and has been replicated in most regions of the world.\n\nHowever, recent research published in the journal Proceedings of the National Academy of Sciences (PNAS) reveals that, in recent years, this system—composed of researchers, academic institutions, government agencies, private companies, and dissemination platforms—shows signs of breaking down.\n\nThe authors argue that due to the large scale and specialization of contemporary science, the contribution of each actor is no longer evaluated by the intrinsic merit of their work, but by quantitative indicators, such as the number of research papers published, how often articles are cited by other research, university rankings, or by awards and other recognitions obtained.\n\n“These indicators have rapidly become targets for measuring institutional and personal impact, which has generated unbridled competition and growing inequality in the distribution of resources, incentives, and rewards,” the authors warn.\n\nThis in turn has led to the proliferation of fraud in some quarters of the scientific community, as researchers look for quick ways to acquire indicators of success. “The use of numerical metrics to evaluate projects and professionals … encourages the search for shortcuts,” says Pere Puigdomènech, president of the Committee for Research Integrity in Catalonia (CIR-CAT) in Spain. The types of fraud detected range from the creation of fictitious research, to plagiarism, to the buying and selling of authorship and citations in papers.\n\nA Mafia That Threatens Scientific Integrity\n\nNorthwestern’s research shows that cases of fraud are often not isolated incidents, but rather the result of complex networks that operate systematically to undermine the integrity of science.\n\nThe research team behind this paper, led by Luis A. N. Amaral, professor of Engineering Science and Applied Mathematics at Northwestern’s McCormick School of Engineering, reached this conclusion after analyzing large volumes of data on retracted publications, editorial records, and image duplication.\n\nSources included major aggregators of scientific literature—such as Web of Science, Scopus, PubMed/MEDLINE, and OpenAlex—as well as lists of journals removed from these databases for violating quality or ethical standards. In addition, data on retracted articles flagged by the investigative website Retraction Watch, comments on the science-paper review site PubPeer, and editorial metadata (editor names and submission and acceptance dates) were also collected and analyzed.\n\nThis analysis highlighted the work of “papermills”—unscrupulous organizations that mass-produce low-quality manuscripts and sell these, sometimes through intermediaries, to academics looking to publish material quickly. These papers often contain falsified data, manipulated or copyright-infringed images, plagiarized content, and even absurd or physically impossible claims. “These networks are essentially criminal organizations, acting together to fake the process of science,” Amaral said in a statement published by Northwestern University."
  },
  {
    "url": "https://www.wired.com/story/how-to-use-parallels-to-run-windows-on-a-mac/",
    "headline": "How to Use Parallels to Run Windows on a Mac",
    "text": "While Apple is very keen that its macOS software is only ever run on Macs, there are numerous options for doing the opposite and running Windows on Apple computers. If you're a developer, or need access to both Windows and Mac apps, or simply want the flexibility of two operating systems, this isn't too difficult to set up with the right tools.\n\nThe option we'll cover here is Parallels Desktop for Mac. This is certainly not the cheapest of your options, but it is fully authorized and legal, as well as being reliable, straightforward, and backed up with regular updates and customer support. It's one of those cases where, we believe, it's worth the investment.\n\nGetting Started\n\nDavid Nield\n\nTo get up and running, you just need a Mac with an internet connection. There are a handful of minimum requirements, but mostly you'll want to be sure you have at least 4 GB of RAM and at least 16 GB free for the Windows installation—Parallels itself is 600 MB.\n\nHead to the Parallels website, and you'll see you can try out Parallels Desktop for Mac for free for 14 days. If you do decide it's worth paying for, the standard subscription that's suitable for most individuals (rather than businesses) will set you back $100 per year.\n\nFollow the link to download the software, and once it's installed on macOS, you'll be taken through the setup process. Along the way, you'll be prompted to download and install Windows 11, which is quite a hefty download: Click the Install Windows button to initiate the process.\n\nParallels sets up a virtual machine on your Mac, then installs Windows inside it—you're essentially installing the operating system as an app, rather than a fundamental layer, so as soon as Parallels is closed (or is uninstalled), Windows goes away with it. Virtualization software like this can cause performance issues and sluggishness, but these issues are thankfully minimized with Parallels."
  }
]